public class Main {
    public static void main(String[] args) {
        Employee[] employeePeople = new Employee[10];
        employeePeople[0] = new Employee("Иванов ", "Иван ", "Иванович ", 1, 1);
        employeePeople[1] = new Employee("Булыга ", "Андрей ", "Александрович ", 1, 2);
        employeePeople[2] = new Employee("Бобрышев ", "Дмитрий ", "Игоревич ", 2, 3);
        employeePeople[3] = new Employee("Королев ", "Владислав ", "Александрович ", 2, 4);
        employeePeople[4] = new Employee("Бедретдинов ", "Ислам ", "Наилович ", 3, 5);
        employeePeople[5] = new Employee("Дыдалин ", "Илья ", "Сергеевич ", 3, 6);
        employeePeople[6] = new Employee("Варакин ", "Кирилл ", "Александрович ", 4, 7);
        employeePeople[7] = new Employee("Муфазалов ", "Тагир ", "Шамильевич ", 4, 8);
        employeePeople[8] = new Employee("Коптев ", "Алексей ", "Александрович ", 5, 9);
        employeePeople[9] = new Employee("Савкин ", "Тимур ", "Константинович ", 5, 10);
       Employee.printEmployee(employeePeople); // вызов метода печати всех сотрудникков
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
       Employee.sumPayEmployee(employeePeople); // выозов метода суммы зарплат всех сотрудников за месяц
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        Employee.minPayEmployee(employeePeople);// вызов метода нахождения минимальной зарплаты
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        Employee.maxPayEmployee(employeePeople);// вызов метода нахождения максимальной зарплаты
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        System.out.println("##########################################################");
        Employee.nameSurnamePatronymic(employeePeople);// вызов метода прописывающий ФИО









    }
}